dongchao980612/STM32ProjectByJDK/3-5 光敏传感器控制蜂鸣器/Hardware/Buzzer.c
#include "stm32f10x.h"                  // Device header
#include "buzzer.h"



static BuzzerCfg_t g_buzzerCfg =
{
    /* Buzzer */
    GPIOB,
    RCC_APB2Periph_GPIOB,
    GPIO_Pin_8,
};

void Buzzer_Init(void)
{
    RCC_APB2PeriphClockCmd(g_buzzerCfg.buzzerClock, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure;

    GPIO_InitStructure.GPIO_Pin =  g_buzzerCfg.buzzerPin;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(g_buzzerCfg.buzzerPort, &GPIO_InitStructure);

    GPIO_ResetBits(g_buzzerCfg.buzzerPort, g_buzzerCfg.buzzerPin);
}

void Buffer_Trun(void)
{
    if(GPIO_ReadOutputDataBit(g_buzzerCfg.buzzerPort, g_buzzerCfg.buzzerPin) == BuzzerMode_ON)
    {
        Buzzer_Off();
    }
    else
    {
        Buzzer_On();
    }
}

void Buzzer_On(void)
{
    GPIO_SetBits(g_buzzerCfg.buzzerPort, g_buzzerCfg.buzzerPin);
}

void Buzzer_Off(void)
{
    GPIO_ResetBits(g_buzzerCfg.buzzerPort, g_buzzerCfg.buzzerPin);
}
